backend/app/controllers/api/v1/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)
SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'daityan13@gmail.com' LIMIT 1
---
      def index
        posts = Post.includes(:user).all
        render json: posts.map { |post|

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 6 ORDER BY `posts`.`created_at` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2
---
      def show
        post = Post.includes(:user).find(params[:id])

INSERT INTO `posts` (`title`, `use_tool`, `content`, `category`, `user_id`, `created_at`, `updated_at`) VALUES ('うまうま', 'あああ', 'ｘｘｘ', 'original', 2, '2024-10-15 07:40:07.549623', '2024-10-15 07:40:07.549623')
---
      def create
        post = current_api_v1_user.posts.new(post_params)
        if post.save

UPDATE `posts` SET `posts`.`title` = 'うまうまxcxxx', `posts`.`use_tool` = 'あああxxxx', `posts`.`content` = 'ｘｘｘxxx', `posts`.`category` = 'cover', `posts`.`updated_at` = '2024-10-15 08:00:28.282508' WHERE `posts`.`id` = 7
---
      def update
        authorize_user! # ユーザーの権限を確認

        if @post.update(update_params)

DELETE FROM `posts` WHERE `posts`.`id` = 4
---
      def destroy
        authorize_user! # ユーザーの権限を確認

        @post.destroy

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 7 ORDER BY `posts`.`created_at` DESC LIMIT 1
---
        def set_post
          @post = Post.find(params[:id])