backend/app/controllers/api/v1/relationships_controller.rb

      def destroy
        other_user = Relationship.find(params[:id]).followed
---
SELECT `relationships`.* FROM `relationships` WHERE `relationships`.`id` = 1 LIMIT 1