backend/app/controllers/api/v1/relationships_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
      def create
        other_user = User.find(params[:followed_id])

SELECT `relationships`.* FROM `relationships` WHERE `relationships`.`follower_id` = 2 AND `relationships`.`followed_id` = 1 LIMIT 1
DELETE FROM `relationships` WHERE `relationships`.`id` = 2
---
      def destroy
        relationship = Relationship.find_by(follower_id: current_api_v1_user.id, followed_id: params[:id])

        if relationship
          # 関係を削除
          relationship.destroy