backend/app/controllers/api/v1/users_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 2 ORDER BY `posts`.`created_at` DESC
---
      def show
        posts = @user.posts.includes(:user)