backend/app/controllers/api/v1/users_controller.rb

      def update_avatar
        @user = User.find(params[:id])

        if params[:avatar].present?
          @user.avatar.attach(params[:avatar]) # attachメソッドを使う

          if @user.save # 保存を行う
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2025-03-25 05:49:43.251501' WHERE `users`.`id` = 2

      def show
        posts = @user.posts.includes(:user)

        # フォロワー数とフォロー数を取得
        following_count = @user.following_count
        follower_count = @user.follower_count

            render json: {
              user_name: @user.name,
              userAvatar: @user.avatar.attached? ? url_for(@user.avatar) : nil,
              posts: posts.map { |post|
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'daityan13@gmail.com' LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 2 ORDER BY `posts`.`created_at` DESC

        def set_user
          @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'daityan13@gmail.com' LIMIT 1